Repository: disba1ancer/ttyhlauncher2
Catalog: TtyhLauncher.Core/Translations/*/LC_MESSAGES/core.po
Languages: ru

source: Failed to switch into online mode!
ru: Не удалось соединиться с сервером. Включён оффлайн-режим!

source: Selected profile does not exist!
ru: Профиль не существует!

source: There are no known client versions!
ru: Нет никакой информации о версиях!

source: New profile
ru: Новый профиль

source: Failed to delete the profile!
ru: Не удалось удалить профиль!

source: Failed to update selected profile! Try to enable a version checking.
ru: Не удалось обновить текущий профиль. Попробуйте включить проверку версии.

source: Failed to login! Are your nickname and password correct?
ru: Ошибка авторизации! Неправльный логин или пароль?

source: Failed to fetch version indexes!
ru: Не удалось получить актуальные индексы версии!

source: Looks like version indexes are corrupted! See details in the log.
ru: Похоже что индексы версии повреждены. Детали ошибки можно найти в логе.

source: Failed to check version files! See details in the log.
ru: Не удалось проверить файлы версии! Детали ошибки можно найти в логе.

source: Failed to download version files! See details in the log.
ru: Не удалось загрузить файлы версии! Детали ошибки можно найти в логе.

source: Something went wrong while minecraft running! See details in the log.
ru: Что-то пошло не так во время запуска игры! Детали ошибки можно найти в логе.
